Revit 2024 API
FabricationPartType.Create Method
 Creates a fabrication part type element based on a specific fabrication servic button and condition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public static FabricationPartType Create(
	Document document,
	FabricationServiceButton button,
	int condition
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	button As FabricationServiceButton, _
	condition As Integer _
) As FabricationPartType
Visual C++
public:
static FabricationPartType^ Create(
	Document^ document,
	FabricationServiceButton^ button,
	int condition
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
button
Type: Autodesk.Revit.DB.FabricationServiceButton
 The fabrication service button.
condition
Type: System.Int32
 The condition index.
Return Value
 The created fabrication part type element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Fabrication service button contains invalid fittings.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The index condition is not larger or equal to 0 and less than ConditionCount.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  The fabrication part type already exists.
See Also
FabricationPartType Class
Autodesk.Revit.DB Namespace